# Homework 3

* Assigned: 10/18 Thursday

* Due: 11/15 Thursday, 10:00 AM via. Instabase + Gradescope

* Value: 3.75% of your grade

In this assignment it's time to get real! You'll first flex your SQL muscles and perform analyses similar to HW2's by writing SQL and reflecting on the experience. You will then perform some normalization.

## Announcement

Homework 3 has two parts. __Part 1__ requires you to __complete and submit via Instabase__ by the token provided. We have setup the environment for you. Part 2 is a written task requiring a hard copy to be submitted on Gradescope.

__Please do not revise any existing block or variable without instruction.__ It may cause failure for running grading script, which will result in some grade deduction. Query quality and correctness will also be part of the grading rubric. We will grade mannually to allow some partial credits.

## Token Setup

In [36]:
# Your columbia uni that is used in SSOL
#
# IMPORTANT:  make sure this is consistent with the uni/alias used as your @columbia.edu email in SSOL
#
UNI = "jq2282"

# your instabase username (if you go to the instabase homepage, your username should be in the URL)
USER = "Jing"

# your repository name containing 
REPO = "Databases4111-Homeworks"

## Database Connection

Run following command to connect to database. You should see "Connected to ..." for successful connection.

In [37]:
# connect to db in public repo
ib.connect_db('ib://ewu/w4111-public/databases/w4111')

Connected to: ib://ewu/w4111-public/databases/w4111

We are using a 1mil-tuple sample** of the iowa liquor sales data for this assignment, with column names and datatype (in format of [name] [datatype]) as:

  - address char(256),
  - bottle_volume_ml integer,
  - category char(256),
  - category_name char(256),
  - city char(256),
  - county char(256),
  - county_number char(256),
  - date date,
  - im_desc char(256),
  - invoice_line_no char(256),
  - itemno integer,
  - name char(256),
  - pack integer,
  - sale_bottles integer,
  - sale_dollars double precision,
  - sale_gallons double precision,
  - sale_liters double precision,
  - state_bottle_cost double precision,
  - state_bottle_retail double precision,
  - store integer,
  - store_location char(256),
  - store_location_address char(256),
  - store_location_city char(256),
  - store_location_zip char(256),
  - vendor_name char(256),
  - vendor_no integer,
  - zipcode text
  
A description of column names can be found here: https://data.iowa.gov/Economy/Iowa-Liquor-Sales/m3tr-qhgy.

You may run this query to have some ideas on the schema you are dealing with:

In [38]:
%%sql
select * from iowa limit 1;

,address,bottle_volume_ml,category,category_name,city,county,county_number,date,im_desc,invoice_line_no,...,state_bottle_cost,state_bottle_retail,store,store_location,store_location_address,store_location_city,store_location_zip,vendor_name,vendor_no,zipcode
0,703 W PLEASANT ST ...,1750,1012200.0 ...,SCOTCH WHISKIES ...,KNOXVILLE ...,Marion ...,63.0 ...,2012-11-19,Old Smuggler Scotch Pet ...,S09069900013 ...,...,11.8300000000000001,17.75,3818,POINT (-93.105641 41.320746) ...,703 W PLEASANT ST ...,KNOXVILLE ...,50138 ...,Shaw Ross International Importers LL ...,460,50138

__Disclaimer: this course does not condone drinking, we are using this dataset because it is a common format for a sales transaction log in a silghtly more accessible domain than typical bank transactions__.

## Part I: SQL, the sequel

### Jupyter Notes: _Read these carefully_

* You **may** create new IPython notebook cells to use for e.g. testing, debugging, exploring, etc.- this is encouraged in fact!- **just make sure that you run the final cell to submit your results**
  * you can press shift+enter to execute to code in the cell that your cursor is in.
* When you see `In [*]:` to the left of the cell you are executing, this means that the code / query is _running_. Please wait for the execution to complete
    * **If the cell is hanging- i.e. running for too long: you can restart the kernel**
    * To restart kernel using the menu bar: "Kernel >> Restart >> Clear all outputs & restart"), then re-execute cells from the top
* _Have fun!_

__Now, please write the SQL query for each of the following questions.__

__Fill answers according to instruction in each question. Make sure to submit your query also (instruction given).__

Note: Some queries will take a few minutes to run on your virtual machine. If your query is running for more than ~10 minutes, you either did something wrong, 
or you may need to create tables with your temp tables to run the query more efficiently. 

For example: If you use the results of a sub-query multiple times, it 
can help to use SELECT ... INTO ... then reference that table.

### __(2 points) Q1.1: Which store had the most sales in terms of total records in the table?__

In [39]:
%%sql
-- Complete your query here
select store, count(*) as cnt
from iowa
group by store
order by cnt desc
limit 1;

  store   cnt
0  2633  8934

In [40]:
# Please replace None with the result store and record number here
# submit query in string format
q1 = {
    'store': 2633,
    'count': 8934,
    'query': 'select store, count(*) as cnt from iowa group by store order by cnt desc limit 1;'
}

### __(2 points) Q1.2: At the store with the most total records (answer to Q1.1), what was the vendor number with most sale records? (The vendor that has the most records in the table?)__

In [41]:
%%sql
-- Complete your query here
select vendor_no, count(*) as cnt
from iowa
where store = 2633
group by vendor_no
order by cnt desc
limit 1;

  vendor_no   cnt
0       260  1509

In [42]:
# please replace None with the result vendor_no and according sum here
# submit query in string format
q2 = {
    'vendor_no': 260,
    'count': 1509,
    'query': 'select vendor_no, count(*) as cnt from iowa where store = 2633 group by vendor_no order by cnt desc limit 1;'
}

### __(3 points) Q1.3: For each zipcode, compute the single most purchased category_name by total sale_bottles. __

__Return the top 5 (zipcode, category_name) when sorted in descending order by the most purchased total sale_bottles.__

In [43]:
%%sql
-- Complete your query here
select i1.zipcode, i1.category_name, i1.sale_bottles
from iowa as i1
join(
    select max(sale_bottles) as msale, zipcode
    from iowa
    group by zipcode
) as tmp
on i1.zipcode = tmp.zipcode and i1.sale_bottles = tmp.msale
order by i1.sale_bottles desc
limit 5;

  zipcode                                      category_name sale_bottles
0   52402  VODKA 80 PROOF                                ...         2712
1   50266  CANADIAN WHISKIES                             ...         2400
2   52240  VODKA 80 PROOF                                ...         2310
3   50311  CANADIAN WHISKIES                             ...         2088
4   51503  VODKA 80 PROOF                                ...         1800

In [44]:
# please replace None with the result accordingly here
# submit query in string format
q3 = {
    1: {'zipcode': 52402, 'category_name': 'VODKA 80 PROOF ...', 'qty': 2712},
    2: {'zipcode': 50266, 'category_name': 'CANADIAN WHISKIES ...', 'qty': 2400},
    3: {'zipcode': 52240, 'category_name': 'VODKA 80 PROOF ...', 'qty': 2310},
    4: {'zipcode': 50311, 'category_name': 'CANADIAN WHISKIES ...', 'qty': 2088},
    5: {'zipcode': 51503, 'category_name': 'VODKA 80 PROOF ...', 'qty': 1800},
    'query': 'select i1.zipcode, i1.category_name, i1.sale_bottles from iowa as i1 join( select max(sale_bottles) as msale, zipcode from iowa group by zipcode) as tmp on i1.zipcode = tmp.zipcode and i1.sale_bottles = tmp.msale order by i1.sale_bottles desc limit 5;'
}

### __(3 points) Q1.4: This problem has two steps, you only need to return the value from second step.__

__Compute the set of all liquors with the characters "tequila" (in lowercase) in its description (`im_desc`). The attribute `itemno` is the one that can serve as a unique identifier for a specific liquor.__

__Return the count of all distinct value of zipcode for all liquor stores that sold at least two of every tequila as defined in the previous sentence.__

(Optional: It is possible to rewrite the query in a form that can execute quite fast, but it will require you to create some temporary tables and/or experiment with alternate forms to express the problem. If you find the solution, feel free to submit it!)

In [45]:
%%sql
-- Complete your query here
select count(distinct i1.zipcode)
from iowa as i1 
join(
select tmp1.store
from (
select store, count(distinct itemno) as cnt
from iowa
where im_desc like '%tequila%'
group by store) as tmp1
where tmp1.cnt >= 2) as tmp2
on i1.store = tmp2.store;

  count
0   116

In [46]:
# please replace None with the according count here
# submit query in string format
q4 = {
    'count': 116,
    'query': 'select count(distinct i1.zipcode) from iowa as i1 join( select tmp1.store from ( select store, count(distinct itemno) as cnt from iowa where im_desc like \'%tequila%\' group by store) as tmp1 where tmp1.cnt >= 2) as tmp2 on i1.store = tmp2.store;'
}

### __(3 points) Q1.5:  __What is the item number (`itemno`) of the liquor with the highest state bottle cost, (as defined below), across all of iowa?

Let a liquor's _bottle cost_ for a given store $S_i$ be the state bottle retail cost per milliliter (mL) based on `state_bottle_retail` (this is the amount the store paid for each bottle of liquor ordered), averaged across all sales at store $S_i$. Note: The `bottle_volume_ml` field provides the volume of each bottle ordered in mL. Ignore the quantity of bottles sold in a sale.

Let a liquor's overall _state bottle cost_ be the average of all the per store costs, averaged across all stores in iowa.

For example: If a single store sells an item (say item no. 100), and has two coresponding records: 10 750 mL bottles of \$10 state bottle cost each (total cost: \$100), and later 1 bottle of a 1000 mL bottle of \$20 (total cost: \$20), the average is (10/750 + 20/1000)/2 = 0.01666...).

In [47]:
%%sql
-- Complete your query here
select itemno
from 
(select itemno, store, avg(state_bottle_retail/bottle_volume_ml) as mean
from iowa
group by itemno, store) as tmp1
group by itemno
order by avg(tmp1.mean) desc
limit 1;

   itemno
0  927368

In [48]:
# please replace None with the item number here
# submit query in string format
q5 = {
    'itemno': 927368,
    'query': 'select itemno from (select itemno, store, avg(state_bottle_retail/bottle_volume_ml) as mean from iowa group by itemno, store) as tmp1 group by itemno order by avg(tmp1.mean) desc limit 1;'
}

### __(3 points) Q1.6: Write a short paragraph about the main differences between writing Python code and writing SQL. List one pro and one con for each approach. __

You may wish to compare the solutions from HW2 and HW3 that compute the same result.

In [49]:
q6 = {
    # put Python's pros and cons here
    # please write in the quotes
    'python_pros': "Python is more fexible. Easy to do partial query or do queries in loops.",
    'python_cons': "Too many libraries and functions. May make mistakes without notice.",
    'sql_pros': "Very uniform and structured. Easy to start with and understand.",
    'sql_cons': "Limited functions. Sometimes it needs a very long code to do the queries."
}

## Part I Submission

### Create your submission file¶

Run the following cell to create a results file for your homework

DO NOT MODIFY THE FOLLOWING CELL!!

In [50]:
import datetime
import json

script_path = '{0}/{1}/fs/Instabase%20Drive'.format(USER, REPO)

with ib.open('results'.format(script_path), "w") as f:
    result = dict(
        q1=q1,
        q2=q2,
        q3=q3,
        q4=q4,
        q5=q5,
        q6=q6,
        uni=UNI,
        user=USER
    )
    f.write(json.dumps(result))
    print "Result file created at: {0}".format(datetime.datetime.now())
  
    print
    print "Check your results: http://instabase.com/{0}/HW3/results".format(script_path)

Result file created at: 2018-11-14 04:53:34.204092

Check your results: http://instabase.com/Jing/Databases4111-Homeworks/fs/Instabase%20Drive/HW3/results

Finally, Submit your __HW3 folder including the results file__ at the following URL:
    
https://www.instabase.com/apps/file-submission/cmd/submit/23eaec3c-154a-4898-848f-bf73b220582d

## Part II, Normalization

See Github page for more details. Submit __hard copy__ for Part 2 as instructed __before due__.

_**Remarks: Dataset sourced from https://data.iowa.gov/Economy/Iowa-Liquor-Sales/m3tr-qhgy. 1mil tuples extracted and preprocessed to remove double quotation marks and apostrophes._